<!-- TERRAFORM PLAN -->

#### 📖 Terraform plan: `success`

<details><summary>Show plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.prod.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-prod]
module.dev.azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-dev]
module.dev.module.db.azurerm_postgresql_flexible_server.db: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-dev/providers/Microsoft.DBforPostgreSQL/flexibleServers/echo-web-db-dev]
module.dev.azurerm_log_analytics_workspace.law: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-dev/providers/Microsoft.OperationalInsights/workspaces/backend-logs-dev]
module.dev.module.cg.azurerm_storage_account.backend[0]: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-dev/providers/Microsoft.Storage/storageAccounts/echowebdevrp]
module.prod.module.cg.azurerm_storage_account.backend[1]: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-prod/providers/Microsoft.Storage/storageAccounts/echowebprodrp1]
module.prod.module.cg.azurerm_storage_account.backend[0]: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-prod/providers/Microsoft.Storage/storageAccounts/echowebprodrp0]
module.prod.azurerm_log_analytics_workspace.law: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-prod/providers/Microsoft.OperationalInsights/workspaces/backend-logs-prod]
module.prod.module.db.azurerm_postgresql_flexible_server.db: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/echo-web-db-prod]
module.prod.module.cg.azurerm_storage_account.load_balancer[0]: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-prod/providers/Microsoft.Storage/storageAccounts/echowebprodlb]
module.dev.module.db.azurerm_postgresql_flexible_server_firewall_rule.db_firewall: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-dev/providers/Microsoft.DBforPostgreSQL/flexibleServers/echo-web-db-dev/firewallRules/echo-web-db-dev-firewall]
module.prod.module.db.azurerm_postgresql_flexible_server_firewall_rule.db_firewall: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-prod/providers/Microsoft.DBforPostgreSQL/flexibleServers/echo-web-db-prod/firewallRules/echo-web-db-prod-firewall]
module.prod.module.cg.azurerm_storage_share.load_balancer[0]: Refreshing state... [id=https://echowebprodlb.file.core.windows.net/echowebprodlb]
module.dev.module.cg.azurerm_storage_share.backend[0]: Refreshing state... [id=https://echowebdevrp.file.core.windows.net/echowebdevrp]
module.prod.module.cg.azurerm_container_group.load_balancer[0]: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-prod/providers/Microsoft.ContainerInstance/containerGroups/echo-web-prod]
module.prod.module.cg.azurerm_storage_share.backend[1]: Refreshing state... [id=https://echowebprodrp1.file.core.windows.net/echowebprodrp1]
module.prod.module.cg.azurerm_storage_share.backend[0]: Refreshing state... [id=https://echowebprodrp0.file.core.windows.net/echowebprodrp0]
module.dev.module.cg.azurerm_container_group.backend[0]: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-dev/providers/Microsoft.ContainerInstance/containerGroups/echo-web-dev]
module.prod.module.cg.azurerm_container_group.backend[0]: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-prod/providers/Microsoft.ContainerInstance/containerGroups/echo-web-prod-0]
module.prod.module.cg.azurerm_container_group.backend[1]: Refreshing state... [id=/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-prod/providers/Microsoft.ContainerInstance/containerGroups/echo-web-prod-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.dev.module.cg.azurerm_container_group.backend[0] must be replaced
-/+ resource "azurerm_container_group" "backend" {
      ~ fqdn                        = "echo-web-dev.norwayeast.azurecontainer.io" -> (known after apply)
      ~ id                          = "/subscriptions/f16e6916-1e71-42a0-9df3-0246b805f432/resourceGroups/echo-web-dev/providers/Microsoft.ContainerInstance/containerGroups/echo-web-dev" -> (known after apply)
      ~ ip_address                  = "20.100.162.1" -> (known after apply)
        name                        = "echo-web-dev"
      + network_profile_id          = (known after apply)
      - subnet_ids                  = [] -> null
        tags                        = {
            "environment" = "development"
        }
      - zones                       = [] -> null
        # (8 unchanged attributes hidden)

      ~ container {
          ~ commands                     = [] -> (known after apply)
          - cpu_limit                    = 0 -> null
          - memory_limit                 = 0 -> null
            name                         = "backend"
          ~ secure_environment_variables = (sensitive value) # forces replacement
            # (4 unchanged attributes hidden)
        }
      ~ container {
          ~ commands                     = [] -> (known after apply)
          - cpu_limit                    = 0 -> null
          - environment_variables        = {} -> null
          - memory_limit                 = 0 -> null
            name                         = "reverse-proxy"
          - secure_environment_variables = (sensitive value)
            # (3 unchanged attributes hidden)

          ~ volume {
                name       = "config"
                # (4 unchanged attributes hidden)
            }
          ~ volume {
                name                 = "caddy-data"
              - secret               = (sensitive value)
                # (6 unchanged attributes hidden)
            }

            # (2 unchanged blocks hidden)
        }

      ~ diagnostics {
          ~ log_analytics {
              - log_type      = "" -> null
              - metadata      = {} -> null
                # (2 unchanged attributes hidden)
            }
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ backend_url_dev = "https://echo-web-dev.norwayeast.azurecontainer.io" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @bakseter, Action: `pull_request`, Workflow: `Terraform format & plan`*